RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_edim_hdsl.h
/*!
    \file    gd32h77x_78x_edim_hdsl.h
    \brief   definitions for the EDIM HDSL

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32H77X_78X_EDIM_HDSL_H
#define GD32H77X_78X_EDIM_HDSL_H

#include "gd32h77x_78x.h"

/* peripheral definitions */
/* peripheral base addresses */
#define EDIM_HDSL                              (EDIM_BASE + 0x00001400U)                               /*!< EDIM_HDSL base address */

/* registers definitions */
/* HDSL drive interface registers */
#define EDIM_HDSL_SYS_CTRL                REG8((EDIM_HDSL) + 0x00000000U)                              /*!< system control register */
#define EDIM_HDSL_SYNC_CTRL               REG8((EDIM_HDSL) + 0x00000001U)                              /*!< synchronization control register */
#define EDIM_HDSL_MASTER_QM               REG8((EDIM_HDSL) + 0x00000003U)                              /*!< quality monitoring register */
#define EDIM_HDSL_EVENT_H                 REG8((EDIM_HDSL) + 0x00000004U)                              /*!< high byte event register */
#define EDIM_HDSL_EVENT_L                 REG8((EDIM_HDSL) + 0x00000005U)                              /*!< low byte event register*/
#define EDIM_HDSL_MASK_H                  REG8((EDIM_HDSL) + 0x00000006U)                              /*!< high byte event mask register */
#define EDIM_HDSL_MASK_L                  REG8((EDIM_HDSL) + 0x00000007U)                              /*!< low byte event mask register */
#define EDIM_HDSL_MASK_SUM                REG8((EDIM_HDSL) + 0x00000008U)                              /*!< summary mask register */
#define EDIM_HDSL_EDGES                   REG8((EDIM_HDSL) + 0x00000009U)                              /*!< edge register */
#define EDIM_HDSL_DELAY                   REG8((EDIM_HDSL) + 0x0000000AU)                              /*!< run time delay register */
#define EDIM_HDSL_VERSION                 REG8((EDIM_HDSL) + 0x0000000BU)                              /*!< version register */
#define EDIM_HDSL_ENC_ID2                 REG8((EDIM_HDSL) + 0x0000000DU)                              /*!< encoder ID 2 register */
#define EDIM_HDSL_ENC_ID1                 REG8((EDIM_HDSL) + 0x0000000EU)                              /*!< encoder ID 1 register */
#define EDIM_HDSL_ENC_ID0                 REG8((EDIM_HDSL) + 0x0000000FU)                              /*!< encoder ID 0 register */
#define EDIM_HDSL_POS4                    REG8((EDIM_HDSL) + 0x00000010U)                              /*!< fast position byte 4 register */
#define EDIM_HDSL_POS3                    REG8((EDIM_HDSL) + 0x00000011U)                              /*!< fast position byte 3 register */
#define EDIM_HDSL_POS2                    REG8((EDIM_HDSL) + 0x00000012U)                              /*!< fast position byte 2 register */
#define EDIM_HDSL_POS1                    REG8((EDIM_HDSL) + 0x00000013U)                              /*!< fast position byte 1 register */
#define EDIM_HDSL_POS0                    REG8((EDIM_HDSL) + 0x00000014U)                              /*!< fast position byte 0 register */
#define EDIM_HDSL_VEL2                    REG8((EDIM_HDSL) + 0x00000015U)                              /*!< speed byte 2 register */
#define EDIM_HDSL_VEL1                    REG8((EDIM_HDSL) + 0x00000016U)                              /*!< speed byte 1 register */
#define EDIM_HDSL_VEL0                    REG8((EDIM_HDSL) + 0x00000017U)                              /*!< speed byte 0 register */
#define EDIM_HDSL_MIR_SUM                 REG8((EDIM_HDSL) + 0x00000018U)                              /*!< mirror status summary register */
#define EDIM_HDSL_PC_BUFFER0              REG8((EDIM_HDSL) + 0x00000020U)                              /*!< parameter channel buffer 0 register */
#define EDIM_HDSL_PC_BUFFER1              REG8((EDIM_HDSL) + 0x00000021U)                              /*!< parameter channel buffer 1 register */
#define EDIM_HDSL_PC_BUFFER2              REG8((EDIM_HDSL) + 0x00000022U)                              /*!< parameter channel buffer 2 register */
#define EDIM_HDSL_PC_BUFFER3              REG8((EDIM_HDSL) + 0x00000023U)                              /*!< parameter channel buffer 3 register */
#define EDIM_HDSL_PC_BUFFER4              REG8((EDIM_HDSL) + 0x00000024U)                              /*!< parameter channel buffer 4 register */
#define EDIM_HDSL_PC_BUFFER5              REG8((EDIM_HDSL) + 0x00000025U)                              /*!< parameter channel buffer 5 register */
#define EDIM_HDSL_PC_BUFFER6              REG8((EDIM_HDSL) + 0x00000026U)                              /*!< parameter channel buffer 6 register */
#define EDIM_HDSL_PC_BUFFER7              REG8((EDIM_HDSL) + 0x00000027U)                              /*!< parameter channel buffer 7 register */
#define EDIM_HDSL_PC_ADD_H                REG8((EDIM_HDSL) + 0x00000028U)                              /*!< high byte long message address register */
#define EDIM_HDSL_PC_ADD_L                REG8((EDIM_HDSL) + 0x00000029U)                              /*!< low byte long message address register */
#define EDIM_HDSL_PC_OFF_H                REG8((EDIM_HDSL) + 0x0000002AU)                              /*!< high byte long message address offset register */
#define EDIM_HDSL_PC_OFF_L                REG8((EDIM_HDSL) + 0x0000002BU)                              /*!< low byte long message address offset register */
#define EDIM_HDSL_PC_CTRL                 REG8((EDIM_HDSL) + 0x0000002CU)                              /*!< parameter channel control register */
#define EDIM_HDSL_PIPE_S                  REG8((EDIM_HDSL) + 0x0000002DU)                              /*!< the sensorhub channel status register */
#define EDIM_HDSL_PIPE_D                  REG8((EDIM_HDSL) + 0x0000002EU)                              /*!< sensorhub FIFO register */
#define EDIM_HDSL_PC_DATA                 REG8((EDIM_HDSL) + 0x0000002FU)                              /*!< parameter channel short message mirror register */
#define EDIM_HDSL_ACC_ERR_CNT             REG8((EDIM_HDSL) + 0x00000038U)                              /*!< fast position error counter register */
#define EDIM_HDSL_MAXACC                  REG8((EDIM_HDSL) + 0x00000039U)                              /*!< fast position acceleration boundary register */
#define EDIM_HDSL_MAXDEV_H                REG8((EDIM_HDSL) + 0x0000003AU)                              /*!< fast position estimator deviation high byte register */
#define EDIM_HDSL_MAXDEV_L                REG8((EDIM_HDSL) + 0x0000003BU)                              /*!< fast position estimator deviation low byte register */
#define EDIM_HDSL_DUMMY                   REG8((EDIM_HDSL) + 0x0000003FU)                              /*!< dummy register */
#define EDIM_HDSL_MIR_ST(n)               REG8((EDIM_HDSL) + 0x00000060U + (0x1U * (n)))               /*!< mirror status n register (n = 0 to 7) */
 
