RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_edim_hdsl.h
/* EDIM_HDSL_MASTER_QM */
#define EDIM_HDSL_MASTER_QM_QM            BITS(0,3)                            /*!< quality monitoring bits */
#define EDIM_HDSL_MASTER_QM_LINK          BIT(7)                               /*!< DSL protocol connection status */

/* EDIM_HDSL_EVENT_H */
#define EDIM_HDSL_EVENT_H_PRST            BIT(0)                               /*!< protocol reset warning */
#define EDIM_HDSL_EVENT_H_DTE             BIT(1)                               /*!< estimator deviation threshold error */
#define EDIM_HDSL_EVENT_H_POS             BIT(3)                               /*!< estimator turned on */
#define EDIM_HDSL_EVENT_H_SUM             BIT(6)                               /*!< remote event monitoring */
#define EDIM_HDSL_EVENT_H_INT             BIT(7)                               /*!< interrupt status */

/* EDIM_HDSL_EVENT_L */
#define EDIM_HDSL_EVENT_L_FREL            BIT(1)                               /*!< channel free for "long message" */
#define EDIM_HDSL_EVENT_L_QMLW            BIT(2)                               /*!< quality monitoring low-value warning */
#define EDIM_HDSL_EVENT_L_ANS             BIT(4)                               /*!< erroneous answer to "long message" */
#define EDIM_HDSL_EVENT_L_MIN             BIT(5)                               /*!< message initialization */

/* EDIM_HDSL_MASK_H */
#define EDIM_HDSL_MASK_H_MPRST            BIT(0)                               /*!< mask for protocol reset warning */
#define EDIM_HDSL_MASK_H_MDTE             BIT(1)                               /*!< mask for estimator deviation threshold error warning */
#define EDIM_HDSL_MASK_H_MPOS             BIT(3)                               /*!< mask for fast position error */
#define EDIM_HDSL_MASK_H_MSUM             BIT(6)                               /*!< mask for remote event monitoring */
 
/* EDIM_HDSL_MASK_L */ 
#define EDIM_HDSL_MASK_L_MFREL            BIT(1)                               /*!< mask for "channel free for "long message"" */
#define EDIM_HDSL_MASK_L_MQMLW            BIT(2)                               /*!< mask for low-quality monitoring value warning */
#define EDIM_HDSL_MASK_L_MANS             BIT(4)                               /*!< mask for erroneous answer to "long message" */
#define EDIM_HDSL_MASK_L_MMIN             BIT(5)                               /*!< mask for message initialization confirmation */

/* EDIM_HDSL_MASK_SUM */
#define EDIM_HDSL_MASK_SUM_MSUM           BITS(0,7)                            /*!< mask for status summary bits */
#define EDIM_HDSL_MASK_SUM_0              BIT(0)                               /*!< mask for status summary bit 0 */
#define EDIM_HDSL_MASK_SUM_1              BIT(1)                               /*!< mask for status summary bit 1 */
#define EDIM_HDSL_MASK_SUM_2              BIT(2)                               /*!< mask for status summary bit 2 */
#define EDIM_HDSL_MASK_SUM_3              BIT(3)                               /*!< mask for status summary bit 3 */
#define EDIM_HDSL_MASK_SUM_4              BIT(4)                               /*!< mask for status summary bit 4 */
#define EDIM_HDSL_MASK_SUM_5              BIT(5)                               /*!< mask for status summary bit 5 */
#define EDIM_HDSL_MASK_SUM_6              BIT(6)                               /*!< mask for status summary bit 6 */
#define EDIM_HDSL_MASK_SUM_7              BIT(7)                               /*!< mask for status summary bit 7 */

/* EDIM_HDSL_EDGES */
#define EDIM_HDSL_EDGES_EDGES             BITS(0,7)                            /*!< identification of edges in the cable signal */

/* EDIM_HDSL_DELAY */
#define EDIM_HDSL_DELAY_CBLDLY            BITS(0,3)                            /*!< 4-bit value for cable delay */
#define EDIM_HDSL_DELAY_RSSI              BITS(4,7)                            /*!< indication of the received signal strength */

/* EDIM_HDSL_VERSION */
#define EDIM_HDSL_VERSION_MINOR           BITS(0,3)                            /*!< minor release number */
#define EDIM_HDSL_VERSION_MAJOR           BITS(4,5)                            /*!< major release number */
#define EDIM_HDSL_VERSION_CODE            BITS(6,7)                            /*!< type of module */

/* EDIM_HDSL_ENC_ID2 */
#define EDIM_HDSL_ENC_ID2_ENCID           BITS(0,3)                            /*!< encoder designation code bit 19 to bit 16 */
#define EDIM_HDSL_ENC_ID2_SCI             BITS(4,6)                            /*!< indication of special characters */

/* EDIM_HDSL_ENC_ID0/1 */
#define EDIM_HDSL_ENC_ID01_ENCID          BITS(0,7)                            /*!< encoder designation code, byte n */

/* EDIM_HDSL_POSn */
#define EDIM_HDSL_POS_POS                 BITS(0,7)                            /*!< fast position, byte n */

/* EDIM_HDSL_VELn */ 
#define EDIM_HDSL_VEL_VEL                 BITS(0,7)                            /*!< speed, byte n */

/* EDIM_HDSL_MIR_SUM */
#define EDIM_HDSL_MIR_SUM_SUM             BITS(0,7)                            /*!< status summary bits */

/* EDIM_HDSL_PC_BUFFERn */
#define EDIM_HDSL_PC_BUFFER_PCBUF         BITS(0,7)                            /*!< parameter channel, byte n */

/* EDIM_HDSL_PC_ADD_H */
#define EDIM_HDSL_PC_ADD_H_LADDH          BITS(0,1)                            /*!< long message address, bit 9 to bit 8 */
#define EDIM_HDSL_PC_ADD_H_LLEN           BITS(2,3)                            /*!< data length of the "long message" */
#define EDIM_HDSL_PC_ADD_H_LIND           BIT(4)                               /*!< indirect addressing of long messages */
#define EDIM_HDSL_PC_ADD_H_LOFF           BIT(5)                               /*!< long message addressing mode/long message error */
#define EDIM_HDSL_PC_ADD_H_LRW            BIT(6)                               /*!< long message, read/write mode */

/* EDIM_HDSL_PC_ADD_L */
#define EDIM_HDSL_PC_ADD_L_LADDL          BITS(0,7)                            /*!< long message address, bit 7 to bit 0 */

/* EDIM_HDSL_PC_OFF_H */
#define EDIM_HDSL_PC_OFF_H_LOFFADDH       BITS(0,6)                            /*!< long message offset value, bit 14 to bit 8 */
#define EDIM_HDSL_PC_OFF_H_LID            BIT(7)                               /*!< long message identification */

/* EDIM_HDSL_PC_OFF_L */
#define EDIM_HDSL_PC_OFF_L_LOFFADDL       BITS(0,7)                            /*!< long message offset value, bit 7 to bit 0 */

/* EDIM_HDSL_PC_CTRL */
#define EDIM_HDSL_PC_CTRL_LSTA            BIT(0)                               /*!< control of the long message start */

/* EDIM_HDSL_PIPE_S */
#define EDIM_HDSL_PIPE_S_PSCI             BIT(0)                               /*!< indication for special characters in the SensorHub Channel */
#define EDIM_HDSL_PIPE_S_PERR             BIT(1)                               /*!< coding error of the bits in the SensorHub Channel */
#define EDIM_HDSL_PIPE_S_PEMP             BIT(2)                               /*!< the SensorHub channel buffer is empty */
#define EDIM_HDSL_PIPE_S_POVR             BIT(3)                               /*!< SensorHub Channel overflow */

