RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_edim_hdsl.h
/* cable and signal functions */
/* get edges in cable signal */
uint8_t edim_hdsl_cable_signal_edge_get(void);
/* get cable delay */
uint8_t edim_hdsl_cable_delay_get(void);
/* get received signal strength */
uint8_t edim_hdsl_received_signal_strength_get(void);

/* version and ID functions */
/* get current version */
uint8_t edim_hdsl_version_get(void);
/* get encoder id information */
uint32_t edim_hdsl_encoder_id_get(void);

/* position and speed functions */
/* get fast position */
uint64_t edim_hdsl_position_read(void);
/* get safe position */
uint64_t edim_hdsl_vposition_read(void);
/* get safe position value from safe channel 2 */
uint64_t edim_hdsl_vposition2_read(void);
/* get speed */
uint32_t edim_hdsl_speed_read(void);

/* status functions */
/* get mirror status summary flag */
uint8_t edim_hdsl_mirror_status_sum_flag_get(void);

/* parameter channel functions */
/* write parameter channel buffer */
void edim_hdsl_long_message_write(uint64_t data);
/* read the answer to a long message in parameter channel buffer */
uint64_t edim_hdsl_long_message_read(void);
/* read errors in encoder resources arising from the previous "long message" operation */
uint16_t edim_hdsl_long_message_error_read(void);
/* initialize EDIM_HDSL long message address struct with a default value */
void edim_hdsl_long_message_addr_init_struct_para_init(edim_hdsl_long_msg_addr_struct *initpara);
/* long message send address initialization */
void edim_hdsl_long_message_addr_init(edim_hdsl_long_msg_addr_struct* msg_addr_struct);
/* long message error flag get */
FlagStatus edim_hdsl_long_message_error_flag_get(void);
/* configure long message addressing offset mode */
void edim_hdsl_long_message_addr_offset_mode_config(uint8_t mode);
/* configure long message read / write mode */
void edim_hdsl_long_message_read_write_mode_config(uint8_t mode);
/* configure long message addressing direction mode */
void edim_hdsl_long_message_addr_direction_config(uint8_t mode);
/* configure long message data length */
void edim_hdsl_long_message_data_length_config(uint8_t length);
/* configure long message address */
void edim_hdsl_long_message_addr_config(uint8_t laddh, uint8_t laddl);
/* configure long message address offset */
void edim_hdsl_long_message_addr_offset_config(uint8_t ladd_off_h, uint8_t ladd_off_l);
/* start "long message" transaction */
void edim_hdsl_long_message_transaction_start(void);

/* sensorhub channel functions */
/* get sensorhub channel flag */
FlagStatus edim_hdsl_sensorhub_channel_flag_get(uint32_t flag);
/* read sensorhub channel data */
uint8_t edim_hdsl_sensorhub_channel_data_read(void);
/* read short message mirror data */
uint8_t edim_hdsl_short_message_mirror_data_read(void);

/* position error and acceleration functions */
/* read position error count */
uint8_t edim_hdsl_position_error_count_read(void);
/* configure fast position acceleration boundary */
void edim_hdsl_fast_position_acc_boundary_config(uint8_t mantissa, uint8_t resolution);
/* configure fast position estimator deviation threshold */
void edim_hdsl_fast_position_estimator_deviation_threshold_config(uint16_t threshold);
/* read fast position estimator deviation */
uint16_t edim_hdsl_fast_position_estimator_deviation_read(void);

/* dummy functions */
/* read dummy */
uint8_t edim_hdsl_dummy_read(void);

/* mirror status functions */
/* access slave mirror system errors, events, and warnings from the DSL encoder */
uint8_t edim_hdsl_mirror_status_flag_access(uint8_t reg_idx);
/* clear slave mirror system errors, events, and warnings from the DSL encoder */
void edim_hdsl_mirror_status_flag_clear(uint8_t reg_idx);

/* safe channel 1 functions */
/* get edges in safe channel 1 cable signal */
uint8_t edim_hdsl_safe_channel1_cable_signal_edge_get(void);
/* get safe channel 1 cable delay */
uint8_t edim_hdsl_safe_channel1_cable_delay_get(void);
/* get received safe channel 1 signal strength */
uint8_t edim_hdsl_received_safe_channel1_signal_strength_get(void);
/* safe channel 1 version information */
uint8_t edim_hdsl_safe_channel1_version_get(void);
/* get safe channel 1 encoder id information */
uint32_t edim_hdsl_safe_channel1_encoder_id_get(void);
/* read safe channel 1 position crc */
uint16_t edim_hdsl_safe_channel1_position_crc_read(void);
/* reset message for the safety-related application */
void edim_hdsl_safe_message_reset(ControlStatus newvalue);
/* reset protocol status for the safety-related application */
void edim_hdsl_safe_protocol_reset(ControlStatus newvalue);
/* get safe status summary flag */
uint8_t edim_hdsl_safe_status_sum_flag_get(void);
/* read parameter channel short message */
uint8_t edim_hdsl_short_message_read(void);

/* encoder status functions */
/* access slave system errors, events, and warnings from the DSL encoder */
uint8_t edim_hdsl_encoder_status_flag_access(uint8_t reg_idx);
/* clear slave system errors, events, and warnings from the DSL encoder */
void edim_hdsl_encoder_status_flag_clear(uint8_t reg_idx);

/* slave RSSI and communication functions */
/* read slave RSSI */
uint8_t edim_hdsl_slave_rssi_read(void);
/* configure slave mail */
void edim_hdsl_slave_mail_config(uint8_t mail);
/* configure slave ping */
void edim_hdsl_slave_ping_write(uint8_t ping);
/* read slave ping */
uint8_t edim_hdsl_slave_ping_read(void);

/* safe channel 2 functions */
/* get safe channel 2 version information */
uint8_t edim_hdsl_safe_channel2_version_get(void);
/* safe channel 2 encoder ID information */
uint8_t edim_hdsl_safe_channel2_encoder_id_get(void);
/* read EDIM_HDSL safe channel 2 fixed bit pattern */
uint8_t edim_hdsl_safe_channel2_fix_bit_read(void);
/* read safe channel 2 position crc */
uint16_t edim_hdsl_safe_channel2_position_crc_read(void);
/* read dummy2 */
uint8_t edim_hdsl_dummy2_read(void);

/* configuration functions */
/* configure hdsl unit0 endian mode */
void edim_hdsl_endian_mode_config(uint8_t mode);
/* select hdsl unit0 interface */
void edim_hdsl_interface_select(uint8_t channel, uint8_t mode);

